jutoroa/STM32F411RE/roboticArm_V3/Src/roboticArmV3.c
	// Definimos el handler para la configuración del STEP del motor3

	handlerStep3Config.pGPIOx 									= GPIOA;
	handlerStep3Config.GPIO_PinConfig.GPIO_PinNumber			= PIN_9;
	handlerStep3Config.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_OUT;
	handlerStep3Config.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerStep3Config.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_PULLUP;
	handlerStep3Config.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerStep3Config.GPIO_PinConfig.GPIO_PinAltFunMode		= AF0;

	GPIO_Config(&handlerStep3Config);

	// Definimos el handler para la dirección del motor3

	handlerDir3Config.pGPIOx 									= GPIOB;
	handlerDir3Config.GPIO_PinConfig.GPIO_PinNumber				= PIN_2;
	handlerDir3Config.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_OUT;
	handlerDir3Config.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	handlerDir3Config.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_PULLUP;
	handlerDir3Config.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerDir3Config.GPIO_PinConfig.GPIO_PinAltFunMode			= AF0;

	GPIO_Config(&handlerDir3Config);

	// Definimos el handler para el servomotor 1 - Timer5 Channel 1

	handlerPinServo1.pGPIOx 									= GPIOA;
	handlerPinServo1.GPIO_PinConfig.GPIO_PinNumber				= PIN_6;
	handlerPinServo1.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_ALTFN;
	handlerPinServo1.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	handlerPinServo1.GPIO_PinConfig.GPIO_PinPuPdControl			= GPIO_PUPDR_NOTHING;
	handlerPinServo1.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerPinServo1.GPIO_PinConfig.GPIO_PinAltFunMode			= AF2;

	GPIO_Config(&handlerPinServo1);

	// Definimos el handler para el servomotor 2 - Timer5 Channel 2

	handlerPinServo2.pGPIOx 									= GPIOA;
	handlerPinServo2.GPIO_PinConfig.GPIO_PinNumber				= PIN_7;
	handlerPinServo2.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_ALTFN;
	handlerPinServo2.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	handlerPinServo2.GPIO_PinConfig.GPIO_PinPuPdControl			= GPIO_PUPDR_NOTHING;
	handlerPinServo2.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerPinServo2.GPIO_PinConfig.GPIO_PinAltFunMode			= AF2;

	GPIO_Config(&handlerPinServo2);

	// Definimos el handler para el servomotor 3 - Timer5 Channel 4

	handlerPinServo3.pGPIOx 									= GPIOB;
	handlerPinServo3.GPIO_PinConfig.GPIO_PinNumber				= PIN_1;
	handlerPinServo3.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_ALTFN;
	handlerPinServo3.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	handlerPinServo3.GPIO_PinConfig.GPIO_PinPuPdControl			= GPIO_PUPDR_NOTHING;
	handlerPinServo3.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerPinServo3.GPIO_PinConfig.GPIO_PinAltFunMode			= AF2;

	GPIO_Config(&handlerPinServo3);

	// Definimos el handler para el servomotor 1 - Timer5 Channel 1
	handlerPWMServo1.ptrTIMx								= TIM3;
	handlerPWMServo1.timerConfig.pwmMode					= TIMER_MODE_UP;
	handlerPWMServo1.timerConfig.pwmSpeed					= TIMER_INCR_SPEED_10us;
	handlerPWMServo1.timerConfig.pwmPeriod					= 2000;
	handlerPWMServo1.timerConfig.pwmDuty					= initialDuty;
	handlerPWMServo1.timerConfig.channel					= PWM_CHANNEL_1;

	PWM_Config(&handlerPWMServo1);

	// Definimos el handler para el servomotor 2 - Timer5 Channel 2
	handlerPWMServo2.ptrTIMx								= TIM3;
	handlerPWMServo2.timerConfig.pwmMode					= TIMER_MODE_UP;
	handlerPWMServo2.timerConfig.pwmSpeed					= TIMER_INCR_SPEED_10us;
	handlerPWMServo2.timerConfig.pwmPeriod					= 2000;
	handlerPWMServo2.timerConfig.pwmDuty					= initialDuty;
	handlerPWMServo2.timerConfig.channel					= PWM_CHANNEL_2;

	PWM_Config(&handlerPWMServo2);

	// Definimos el handler para el servomotor 3 - Timer5 Channel 3
	handlerPWMServo3.ptrTIMx								= TIM3;
	handlerPWMServo3.timerConfig.pwmMode					= TIMER_MODE_UP;
	handlerPWMServo3.timerConfig.pwmSpeed					= TIMER_INCR_SPEED_10us;
	handlerPWMServo3.timerConfig.pwmPeriod					= 2000;
	handlerPWMServo3.timerConfig.pwmDuty					= initialDuty;
	handlerPWMServo3.timerConfig.channel					= PWM_CHANNEL_4;

	PWM_Config(&handlerPWMServo3);

	// Configuración del ADC
	handlerADC.channel									= ADC_CHANNEL_8;
	handlerADC.resolution								= ADC_RESOLUTION_12_BIT;
	handlerADC.samplingPeriod							= ADC_SAMPLING_PERIOD_28_CYCLES;
	handlerADC.dataAlignment							= ADC_ALIGNMENT_RIGHT;
	handlerADC.numberOfChannels							= 1;
	handlerADC.channelMode								= ADC_SINGLE_CHANNEL;
	adc_Config(&handlerADC);

//	********************************************************************************************************************************


	// Configuración del pin PA3 USB RX
	handlerUSBRX.pGPIOx									= GPIOA;
	handlerUSBRX.GPIO_PinConfig.GPIO_PinNumber			= PIN_3;
	handlerUSBRX.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_ALTFN;
	handlerUSBRX.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerUSBRX.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_NOTHING;
	handlerUSBRX.GPIO_PinConfig.GPIO_PinSpeed			= GPIO_OSPEED_FAST;
	handlerUSBRX.GPIO_PinConfig.GPIO_PinAltFunMode 		= AF7;

	GPIO_Config(&handlerUSBRX);

	// Configuración del pin PA2 USB TX
	handlerUSBTX.pGPIOx									= GPIOA;
	handlerUSBTX.GPIO_PinConfig.GPIO_PinNumber			= PIN_2;
	handlerUSBTX.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_ALTFN;
	handlerUSBTX.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerUSBTX.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_NOTHING;
	handlerUSBTX.GPIO_PinConfig.GPIO_PinSpeed			= GPIO_OSPEED_FAST;
	handlerUSBTX.GPIO_PinConfig.GPIO_PinAltFunMode 		= AF7;

	GPIO_Config(&handlerUSBTX);

	// Configuración del pin PA3 USB RX Bluetooth
	handlerUsartBluetoothRX.pGPIOx									= GPIOA;
	handlerUsartBluetoothRX.GPIO_PinConfig.GPIO_PinNumber			= PIN_12;
	handlerUsartBluetoothRX.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_ALTFN;
	handlerUsartBluetoothRX.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerUsartBluetoothRX.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_NOTHING;
	handlerUsartBluetoothRX.GPIO_PinConfig.GPIO_PinSpeed			= GPIO_OSPEED_FAST;
	handlerUsartBluetoothRX.GPIO_PinConfig.GPIO_PinAltFunMode 		= AF8;

	GPIO_Config(&handlerUsartBluetoothRX);

